from django.shortcuts import render
import folium

def nature_reserves_map(request):
    # Створення мапи
    m = folium.Map(location=[49.6, 31.5], zoom_start=6)

    # Додавання маркерів для кожного заповідника з короткою інформацією
    nature_reserve_info = {
        "Ґорґани": {"location": (49.116667, 24.483333), "info": "Гірські ліси та унікальна флора і фауна."},
        "Дніпровсько-Орільський": {"location": (49.242222, 32.678056), "info": "Великий водно-болотний масив."},
        "Древлянський": {"location": (51.670833, 33.1575), "info": "Унікальні лісові комплекси."},
        "Єланецький степ": {"location": (47.697222, 34.0075), "info": "Типові степи з рідкісними видами тварин."},
        "Казантипський": {"location": (45.938611, 35.359722), "info": "Унікальні узбережжя та морські болота."},
        "Канівський": {"location": (49.974722, 31.540556), "info": "Лісові масиви з численними пам'ятками природи."},
        "Карадазький": {"location": (46.062222, 35.883611), "info": "Гірські ліси та дикий Кримський ландшафт."},
        "Кримський": {"location": (44.621111, 33.549444), "info": "Морські ліси та гірські пейзажі."},
        "Луганський": {"location": (49.8725, 38.712778), "info": "Унікальні болота та піщані пустелі."},
        "Медобори": {"location": (50.584167, 30.306944), "info": "Збережені лісові масиви та багатий флористичний склад."},
        "Мис Мартьян": {"location": (45.3725, 36.383889), "info": "Унікальна природа півострова Крим."},
        "Михайлівська цілина": {"location": (47.978056, 31.713611), "info": "Степові ландшафти зі збереженими дикими травами."},
        "Опуцький": {"location": (49.201944, 34.8925), "info": "Унікальні геологічні утворення."},
        "Поліський": {"location": (51.245833, 30.733056), "info": "Великі лісові комплекси."},
        "Розточчя": {"location": (49.084722, 24.3825), "info": "Глибокі яри та лісові масиви."},
        "Рівненський": {"location": (51.516667, 25.999722), "info": "Озера та лісові угіддя."},
        "Український степовий": {"location": (47.928056, 35.0125), "info": "Степи та пісчані дюни."},
        "Черемський": {"location": (48.534167, 34.499444), "info": "Лісові масиви та водні екосистеми."},
        "Ялтинський гірсько-лісовий": {"location": (44.5325, 34.243611), "info": "Гірські ліси південного Криму."}
    }

    for name, details in nature_reserve_info.items():
        folium.Marker(
            location=details["location"],
            popup=f"<b>{name}</b><br>{details['info']}",
            tooltip=name
        ).add_to(m)

    # Передача мапи у шаблон
    folium_map = m._repr_html_()

    return render(request, 'map.html', {'folium_map': folium_map})